Repository: sheilagomes/wp-trad
Catalog: tm/PHP_en-pt_BR.tmx
Source language: en
Languages: pt_br

source: Example 1. sprintf(): zero-padded integers
pt_br: Exemplo 1. sprintf(): zero-padded integers

source: Example 2. sprintf(): formatting currency
pt_br: Exemplo 2. sprintf(): formatting currency

source: fputs() is an alias to fwrite(), and is identical in every way.
pt_br: fputs() é uma função sinônima (alias) para fwrite(), e é identica em todas as maneiras.

source: Note that the length parameter is optional and if not specified the entire string will be written.
pt_br: Note que o parametro comprimento é opcional e se não for especificado a string inteira será escrita.

source: fread() reads up to length bytes from the file pointer referenced by handle.
pt_br: fread() lê até comprimento bytes.

source: Reading stops when length bytes have been read or EOF (end of file) reached, whichever comes first.
pt_br: A leitura é interrompida quando comprimento bytes foram lidos ou o fim do arquivo (eof) foi alcançado, o que ocorrer primeiro.

source: ?php / / get contents of a file into a string $filename = "/ usr / local / something.txt"; $handle = fopen ($filename, "r"); $contents = fread ($handle, filesize ($filename)); fclose ($handle);?
pt_br: ?php / / ler o conteúdo do arquivo para uma string $nomedoarquivo = "/ usr / local / algo.txt"; $fd = fopen ($nomedoarquivo, "r"); $conteudo = fread ($fd, filesize ($nomedoarquivo)); fclose ($fd);?

source: Windows) the file must be opened with'b 'included in fopen() mode parameter.
pt_br: Em sistemas que diferenciam entre arquivos binários e texto (por exemplo Windows) o arquivo tem que ser aberto com 'b 'incluído como parametro na função fopen().

source: ?php $filename = "c:\\files\\somepic.gif"; $handle = fopen ($filename, "rb"); $contents = fread ($handle, filesize ($filename)); fclose ($handle);?
pt_br: ?php $nomedoarquivo = "c:\\arquivos\\algumaimg.gif"; $fd = fopen ($nomedoarquivo, "rb"); $conteudo = fread ($fd, filesize ($nomedoarquivo)); fclose ($fd);?

source: See also fwrite(), fopen(), fsockopen(), popen(), fgets(), fgetss(), fscanf(), file(), and fpassthru().
pt_br: Veja também fwrite(), fopen(), fsockopen(), popen(), fgets(), fgetss(), fscanf(), file() e fpassthru().

source: (PHP 4 = 4.0.4)
pt_br: fribidi_log2vis

source: If only two parameters were passed to this function, the values parsed will be returned as an array.
pt_br: Descrição

source: Any whitespace in the format string matches any whitespace in the input stream.
pt_br: Se somente dois parametros forem passados para a função, os valores interpretados serão retornados como um array.

source: This means that even a tab \t in the format string can match a single space character in the input stream.
pt_br: Os parametros opcionais tem que ser passados por referência.

source: Example 1. fscanf() Example
pt_br: Isto significa que qualquer tabulação \t na string formato poderá bater com um caracter de espaço simples no stream de entrada.

source: Example 2. users.txt
pt_br: Exemplo do fscanf()

source: Prior to PHP 4.3.0, the maximum number of characters read from the file was 512 (or up to the first \n, whichever came first).
pt_br: $fp = fopen ("users.txt" ,"r"); while ($userinfo = fscanf ($fp, "%s\t%s\t%s\n")) {list ($name, $profission, $countrycode) = $userinfo; / /... fazer algo com os valores} fclose($fp);

source: As of PHP 4.3.0 arbitrarily long lines will be read and scanned.
pt_br: Exemplo 2. users.txt

source: See also fread(), fgets(), fgetss(), sscanf(), printf(), and sprintf().
pt_br: Veja também fread(), fgets(), fgetss(), sscanf(), printf() e sprintf().

source: Sets the file position indicator for the file referenced by handle .The new position, measured in bytes from the beginning of the file, is obtained by adding offset to the position specified by whence, whose values are defined as follows:
pt_br: A nova posição é obtida, medindo em bytes do início do arquivo, é obtida ao adicionar offset a posição especificada por whence, cujo valor é definido como se segue:

source: SEEK_SET - Set position equal to offset bytes.
pt_br: SEEK_SET - Use a posição igual à offset bytes.

source: SEEK_CUR - Set position to current location plus offset.
pt_br: SEEK_CUR - Use a posição para a localização atual mais offset.

source: SEEK_END - Set position to end-of-file plus offset. (To move to a position before the end-of-file, you need to pass a negative value in offset.)
pt_br: SEEK_END - Use a posição para o fim do arquivo (eof) mais offset. (Para mover para uma posição anterior ao fim de arquivo, você precisa passar um valor negativo em offset.)

source: If whence is not specified, it is assumed to be SEEK_SET.
pt_br: Se whence não é especificado é presumido ser SEEK_SET.

source: Upon success, returns 0; otherwise, returns -1.
pt_br: Em caso de sucesso, retorna 0; caso contrário, retorna -1.

source: Note that seeking past EOF is not considered an error.
pt_br: Note que fazer um seek depois do fim do arquivo (eof) é considerado um erro.

source: May not be used on file pointers returned by fopen() if they use the "http: / / "or "ftp: / /" formats.
pt_br: Não pode ser usado em ponteiros de arquivo retornados por fopen() se for usado o formato "http: / / "ou "ftp: / /".

source: The whence argument was added after PHP 4.0.0.
pt_br: O argumento whence foi adicionado depois do PHP 4.0.0.

source: See also ftell() and rewind().
pt_br: Veja também ftell() e rewind().

source: Example 1. fsockopen() Example
pt_br: Exemplo 1. fsockopen() Example

source: Gathers the statistics of the file opened by the file pointer handle.
pt_br: Mantém estatísticas do arquivo aberto pelo ponteiro de arquivos fp.

source: This function is similar to the stat() function except that it operates on an open file pointer instead of a filename.
pt_br: Esta função é similar a função stat() exceto que ela opera em um ponteiro de arquivo aberto ao invéz de um nome de arquivo.

source: Returns an array with the statistics of the file with the following elements:
pt_br: Retorna um array com as estatísticas do arquico com os seguintes elementos:

source: user id of owner
pt_br: user id do dono (owner)

source: device type if inode device *
pt_br: tipo de device se inode device *

source: time of last access
pt_br: tempo do último acesso

source: time of last modification
pt_br: tempo da última modificação( modification)

source: time of last change
pt_br: tempo da última mudança( change)

source: blocksize for filesystem I / O *
pt_br: tamanho do bloco para o filesystem I / O *

source: number of blocks allocated
pt_br: número de blocos alocados

source: Returns the position of the file pointer referenced by handle; i.e., its offset into the file stream.
pt_br: Retorna a posição do ponteiro de arquivo referenciado por fp; por exemplo o seu offset no file stream.

source: The file pointer must be valid, and must point to a file successfully opened by fopen() or popen().
pt_br: O ponteiro de arquivo tem que ser válidoe apontar para um arquivo aberto com sucesso por fopen() ou popen().

source: See also fopen(), popen(), fseek(), and rewind().
pt_br: Veja também fopen(), popen(), fseek() e rewind().

source: ftp_close
pt_br: ftp_chmod

source: ftp_close() closes ftp_stream and releases the resource.
pt_br: Description

source: ftp_chdir
pt_br: ftp_chmod

source: (PHP 3 = 3.0.13, PHP 4)
pt_br: ftp_connect

source: Returns a FTP stream on success or FALSE on error.
pt_br: Description

source: ftp_fget() retrieves remote_file from the FTP server, and writes it to the given file pointer, fp.
pt_br: ftp_fget() retrieves remote_file from the FTP server, and writes it to the given file pointer, handle.

source: ftp_fput() uploads the data from the file pointer fp until the end of the file is reached.
pt_br: ftp_fput() uploads the data from the file pointer handle ftp_fput() uploads the data from the file pointer handle until the end of the file is reached.

source: This function is only available in CVS.
pt_br: Nota:

source: Example 1. ftp_get_option() example
pt_br: Exemplo 1. ftp_get_option() example

source: Creates the specified directory.
pt_br: Description

source: Continues retrieving / sending a file nbronously
pt_br: Description

source: ftp_nb_fget() retrieves remote_file from the FTP server, and writes it to the given file pointer, fp.
pt_br: ftp_nb_fget() retrieves remote_file from the FTP server, and writes it to the given file pointer, handle.

source: ftp_nb_fput() uploads the data from the file pointer fp ftp_nb_fput() uploads the data from the file pointer fp until it reaches the end of the file.
pt_br: ftp_nb_fput() uploads the data from the file pointer handle until it reaches the end of the file.

source: Example 1. ftp_nb_get() example
pt_br: Exemplo 1. ftp_nb_get() example

source: ftp_nb_put() stores local_file on the FTP server, as remote_file.
pt_br: Description

source: Example 1. ftp_nb_put() example
pt_br: Exemplo 1. ftp_nb_put() example

source: Example 1. ftp_put() example
pt_br: Exemplo 1. ftp_put() example

source: Example 1. ftp_set_option() example
pt_br: Exemplo 1. ftp_set_option() example

source: Returns a SSL-FTP stream on success or FALSE on error.
pt_br: Description

source: Takes the filepointer, handle, and truncates the file to length, size.
pt_br: Pega o ponteiro de arquivo, fp, e corta o arquivo no comprimento especificado.

source: fwrite() writes the contents of string to the file stream pointed to by handle.
pt_br: fwrite() grava os conteúdos de string para o stream de arquivo apontado por fp.

source: If the length argument is given, writing will stop after length bytes have been written or the end of string is reached, whichever comes first.
pt_br: Se o argumento comprimento é dado, a gravação irá parar depois de que comprimento bytes foram escritos ou o fim da string é alcançada, o que ocorrer primeiro.

source: fwrite() returns the number of bytes written, or FALSE on error.
pt_br: fwrite() retorna o número de bytes gravados, ou FALSE em caso de erro.

source: Note that if the length argument is given, then the magic_quotes_runtime configuration option will be ignored and no slashes will be stripped from string.
pt_br: Note que se o argumento comprimento é dado, então a opção de configuração magic_quotes_runtime será ignorada e nenhuma barra será retirada do string.

source: A simple fwrite example
pt_br: Exemplo fwrite

source: ?php $filename = 'test.txt'; $somecontent = "Add this to the file\n"; / / Let's make sure the file exists and is writable first. if (is_writable($filename)) {/ / In our example we're opening $filename in append mode. / / The file pointer is at the bottom of the file hence / / that's where $somecontent will go when we fwrite() it. if (!$handle = fopen($filename, 'a')) {print "Cannot open file ($filename)"; exit;} / / Write $somecontent to our opened file. if (!fwrite($handle, $somecontent)) {print "Cannot write to file ($filename)"; exit;} print "Success, wrote ($somecontent) to file ($filename)"; fclose($handle);} else {print "The file $filename is not writable";}?
pt_br: ?php $filename = 'teste.txt'; $somecontent = "Acrescentando isto no arquivo\n"; / / Tendo certeza que o arquivo existe e que há permissão de escrita primeiro. if (is_writable($filename)) {/ / Em nosso exemplo, nós estamos abrindo $filename em modo de append (acréscimo). / / O ponteiro do arquivo estará no final dele desde / / que será aqui que $somecontent será escrito com fwrite(). if (!$fp = fopen($filename, 'a')) {print "Erro abrindo arquivo ($filename)"; exit;} / / Escrevendo $somecontent para o arquivo aberto. if (!fwrite($fp, $somecontent)) {print "Erro escrevendo no arquivo ($filename)"; exit;} print "Sucesso: escrito ($somecontent) no arquivo ($filename)"; fclose($fp);} else {print "The file $filename is not writable";}?

source: See also fread(), fopen(), fsockopen(), popen(), and fputs().
pt_br: Veja também fread(), fopen(), fsockopen(), popen() e fputs().

source: getallheaders() is an alias for apache_request_headers().
pt_br: getallheaders() é um sinônimo para apache_request_headers().

source: It will return an associative array of all the HTTP headers in the current request.
pt_br: Ela retorna um array associativo de todos os headers HTTP da requisição atual.

source: Please read the apache_request_headers() documentation for more information on how this function works.
pt_br: Veja a documentação de apache_request_headers() para mais detalhes do funcionamento dessa função.

source: In PHP 4.3.0, getallheaders() became an alias for apache_request_headers().
pt_br: No PHP 4.3.0, getallheaders() se tornou um apelido de apache_request_headers().

source: Essentially, it was renamed.
pt_br: Essencialmente, ela foi renomeada.

source: This is because this function only works when PHP is compiled as an Apache Module.
pt_br: Isto porque a função somente funciona quando o PHP é compilado com um módulo do Apache.

source: See also apache_request_headers().
pt_br: Veja também apache_request_headers().

source: By default, the value of HTTP_USER_AGENT is used; however, you can alter this (i.e., look up another browser's info) by passing the optional user_agent parameter to get_browser().
pt_br: Descrição

source: The information is returned in an object, which will contain various data elements representing, for instance, the browser' s major and minor version numbers and ID string; TRUE / FALSE values for features such as frames, JavaScript, and cookies; and so forth.
pt_br: Por padrão, o valor de $HTTP_USER_AGENT é usado; em qualquer caso você pode alterar isto (ex., procurar informação de outro browser) passando o parâmetro opcional user_agent para a função get_browser().

source: The format of the file is fairly self-explanatory.
pt_br: A informação é retornada como um objeto, que contém vários elementos com dados representando, por exemplo, os números de versão maior e menor, a string de ID, valores TRUE / false para coisas como frames, JavaScript, e cookies; e assim em diante.

source: The following example shows how one might list all available information retrieved about the user 's browser.
pt_br: O formato do arquivo é auto-explicatório.

source: Example 1. get_browser() example
pt_br: O exemplo a seguir irá mostrar uma possível lista de toda a informação disponível sobre o browser do usuário.

source: ?php echo $_SERVER[ 'HTTP_USER_AGENT']. "hr / \n"; $browser = get_browser(); foreach ($browser as $name = $value) {print" b $name / b $value br / \n";}?
pt_br: Exemplo 1.

source: The output of the above script would look something like this:
pt_br: Exemplo get_browser()

source: In order for this to work, your browscap configuration setting in php.ini must point to the correct location of the browscap.ini file on your system. browscap.ini is not bundled with PHP but you may find an up-to-date browscap.ini file here.
pt_br: ?php function list_array ($array) {while (list ($key, $value) = each ($array)) {$str .= "b $key: / b $value br / \n";} return $str;} echo "$HTTP_USER_AGENT hr / \n"; $browser = get_browser(); echo list_array ((array) $browser);?

source: By default, the browscap directive is commented out.
pt_br: A saída do script acima deve ser algo como isto:

source: The cookies The cookies value simply means that the browser itself is capable of accepting cookies and does not mean the user has enabled the browser to accept cookies or not.
pt_br: Mozilla / 4.5 [en] (X11; U; Linux 2.2.9 i586) hr / b browser_name_pattern: / b Mozilla / 4\.5.* br / b parent: / b Netscape 4.0 br / b platform: / b Unknown br / b majorver: / b 4 br / b minorver: / b 5 br / b browser: / b Netscape br / b version: / b 4 br / b frames: / b 1 br / b tables: / b 1 br / b cookies: / b 1 br / b backgroundsounds: / b br / b vbscript: / b br / b javascript: / b 1 br / b javaapplets: / b 1 br / b activexcontrols: / b br / b beta: / b br / b crawler: / b br / b authenticodeupdate: / b br / b msn: / b br /

source: The only way to test if cookies are accepted is to set one with setcookie(), reload, and check for the value.
pt_br: In order for this to work, your browscap configuration file setting must point to the correct location of the browscap.ini file.

source: In this case, you will pass in $HTTP_SERVER_VARS[ 'HTTP_USER_AGENT'].
pt_br: For more information (including locations from which you may obtain a browscap.ini file), check the PHP FAQ at http: / /www.php.net / FAQ.php.

source: This function returns the name of the class of which the object obj is an instance.
pt_br: Esta função retorna o nome da classe da qual o objeto obj é instância.

source: Returns FALSE if obj is not an object.
pt_br: Retorna FALSE se obj não é um objeto.

source: A class defined in a PHP extension is returned in its original notation.
pt_br: Uma classe definida em uma extensão do PHP é retornada em sua notação original.

source: See also get_parent_class(), gettype(), and is_subclass_of().
pt_br: Veja também get_parent_class(), gettype() e is_subclass_of().

source: This function returns an array of method names defined for the class specified by class_name.
pt_br: Esta função retorna uma matriz com nomes dos métodos definidos para a classe especificada por class_name.

source: As of PHP 4.0.6, you can specify the object itself instead of class_name.
pt_br: A partir do PHP 4.0.6, você pode especificar o próprio objeto em vez no nome da classe em class_name.

source: $class_methods = get_class_methods( $my_class); / / see below the full example
pt_br: $class_methods = get_class_methods( $my_class); / / veja um exemplo completo abaixo

source: Example 1. get_class_methods() example
pt_br: Exemplo get_class_methods()

source: Will produce:
pt_br: Produzirá:

source: See also get_class_vars() and get_object_vars().
pt_br: Veja também get_class_vars() e get_object_vars().

source: This function will return an associative array of default properties of the class.
pt_br: Esta função retornará uma matriz associativa com as propriedades padrão da classe.

source: The resulting array elements are in the form of varname = value.
pt_br: Os elementos resultantes da matriz estão na forma nome_variavel = valor.

source: Prior to PHP 4.2.0, Uninitialized class variables will not be reported by get_class_vars().
pt_br: Variáveis de classe não iniciadas não serão exibidos por get_class_vars().

source: Example 1. get_class_vars() example
pt_br: Exemplo get_class_vars()

source: / / Before PHP 4.2.0 var2: xyz var3:
pt_br: Produzirá:

source: 100 / / As of PHP 4.2.0 var1: var2: xyz var3:
pt_br: var2: xyz var3:

source: See also get_class_methods(), get_object_vars()
pt_br: Veja também get_class_methods() e get_object_vars()

source: Returns the name of the owner of the current PHP script.
pt_br: Description

source: Returns the current working directory.
pt_br: Retorna o diretório atual.

source: See also chdir().
pt_br: Veja também: chdir().

source: Returns an associative array containing the date information of the timestamp, or the current local time if no timestamp is given, as the following array elements:
pt_br: Retorna uma matriz contendo a data do timestamp, ou a hora corrente local se se nenhum timestamp é dado, como a seguintes elementos da matriz:

source: "seconds" - seconds
pt_br: "seconds" - segundos

source: "minutes" - minutes
pt_br: "minutes" - minutos

source: "hours" - hours
pt_br: "hours" - horas

source: "mday" - day of the month
pt_br: "mday" - dia do ano

source: "wday" - day of the week, numeric: from 0 as Sunday up to 6 as Saturday
pt_br: "wday" - dia da semana, numérico: de 0 como Domingo até 6 como Sábado

source: "mon" - month, numeric
pt_br: "mon" - mês, numérico

source: "year" - year, numeric
pt_br: "year" - ano, numérico

source: "yday" - day of the year, numeric; i.e. "299 "
pt_br: "yday" - dia do ano, numérico; i.e. "299 "

source: "weekday" - day of the week, textual, full; i.e. "Friday "
pt_br: "weekday" - dia da semana, texo, completo; i.e. "Friday "

source: "month" - month, textual, full; i.e. "January "
pt_br: "month" - mês, texto, completo; i.e. "January "

source: Example 1. getdate() example
pt_br: Exemplo 1. getdate() exemplo

source: This function returns an array of the names of the declared classes in the current script.
pt_br: Descrição

source: In PHP 4.0.1pl2, three extra classes are returned at the beginning of the array: stdClass (defined in Zend / zend.c), OverloadedTestClass (defined in ext / standard / basic_functions.c) and Directory (defined in ext / standard / dir.c).
pt_br: Esta função retorna uma matriz com os nomes das classes declaradas no script em execução.

source: Also note that depending on what libraries you have compiled into PHP, additional classes could be present.
pt_br: Nota:

source: There is a list of predefined classes in the Predefined Classes section of the appendices.
pt_br: A partir do PHP 4.0.1pl2, três classes extras são retornadas no início da matriz: stdClass (definida em Zend / zend.c), OverloadedTestClass (definida em ext / standard / basic_functions.c) e Directory (definida em ext / standard / dir.c).

source: See also class_exists().
pt_br: Isto significa que você não será capaz de distinguir suas próprias classes usando estes nomes.

source: get_html_translation_table() will return the translation table that is used internally for htmlspecialchars() and htmlentities().
pt_br: get_html_translation_table() retornará a tabela de tradução que é usada internamente por htmlspecialchars() e htmlentities().

source: There are two new defines (HTML_ENTITIES, HTML_SPECIALCHARS) that allow you to specify the table you want.
pt_br: Há duas novas definidas (HTML_ENTITIES, HTML_SPECIALCHARS) que permite especificar a tabela que você quer.

source: And as in the htmlspecialchars() and htmlentities() functions you can optionally specify the quote_style you are working with.
pt_br: E como nas funções htmlspecialchars() e htmlentities() você pode opcionalmente especificar a quote_style que você está trabalhando.

source: The default is ENT_COMPAT mode.
pt_br: O padrão é modo ENT_COMPAT.

source: See the description of these modes in htmlspecialchars().
pt_br: Veja a descrição desses modos em htmlspecialchars().

source: Translation Table Example
pt_br: Exemplo de tabela de tradução

source: The cool thing is using array_flip() to change the direction of the translation.
pt_br: Legal é usar array_flip() para mudar a direção da tradução.

source: See also htmlspecialchars(), htmlentities(), strtr(), and array_flip().
pt_br: Veja também htmlspecialchars(), htmlentities(), strtr(), e array_flip().

source: Example 1. getimagesize (file)
pt_br: Exemplo 1. getimagesize (file)

source: Example 2. getimagesize (URL)
pt_br: Exemplo 2. getimagesize (URL)

source: Example 3. getimagesize() and MIME types
pt_br: Exemplo 3. getimagesize() and MIME types

source: Example 4. getimagesize() returning IPTC
pt_br: Exemplo 4. getimagesize() returning IPTC

source: Example 1. get_included_files() Example
pt_br: Exemplo 1. get_included_files() Example

source: Example 1. getlastmod() example
pt_br: Exemplo 1. getlastmod() example

source: Searches DNS for MX records corresponding to hostname.
pt_br: Description

source: Returns the current script 's inode, or FALSE on error.
pt_br: Description

source: This function returns an associative array of defined object properties for the specified object obj.
pt_br: Descrição

source: In versions prior to PHP 4.2.0, if the variables declared in the class of which the obj is an instance, have not been assigned a value, those will not be returned in the array.
pt_br: Esta função retorna uma matriz associativa com as propriedades definidas do objeto informado em obj.
